In [5]:
import pandas as pd
data = [
    
    {"Name":"Keyboard","Category":"Hardware","price":1200},
    {"Name":"Doll","Category":"Toy","price":500},
    {"Name":"Iphone12","Category":"Telephone","price":32000},
    {"Name":"Latte","Category":"Coffee","price":65}
    ]

In [11]:
df = pd.DataFrame(data)
df

       Name   Category  price
0  Keyboard   Hardware   1200
1      Doll        Toy    500
2  Iphone12  Telephone  32000
3     Latte     Coffee     65

change 1 time

In [12]:
df.set_index(["Name"])

           Category  price
Name
Keyboard   Hardware   1200
Doll            Toy    500
Iphone12  Telephone  32000
Latte        Coffee     65

save info

In [13]:
df.set_index(["Name"],inplace=True)
df

           Category  price
Name
Keyboard   Hardware   1200
Doll            Toy    500
Iphone12  Telephone  32000
Latte        Coffee     65